Repository: 84000/data-translation-memory
Catalog: toh349-v4.tmx
Source language: bo
Languages: en

source: །འཇིགས་ཤིང་སྐྲག་པ་རྣམས་ཀྱི་སྐྱབས། །སློང་བ་རྣམས་ནི་བགྲོད་བྱའི་མཆོག །
en: “ ‘Where is he who is a refuge for the fearful? Where is the one to whom all beggars travel,

source: སྙན་སྨྲ་སྦྱིན་དང་ཚུལ་ཁྲིམས་ལྡན། །བདག་ཉིད་ཆེ་དེ་གང་ན་བཞུགས། །
en: The one who speaks pleasantly, He who gives generously and upholds discipline?

source: བདག་མདུན་འཆི་བ་ཉེར་འོང་གིས། །ཤི་བི་པ་རྣམས་མྱུར་དུ་སྨྲོས།
en: “ ‘Quickly, death is looming before me. Tell me, people of Śibi, where can I see him?

source: །ཐུགས་རྗེ་ཅན་དེ་མ་གཏོགས་པར།
en: No one but the great compassionate one

source: །གང་ལ་ལུས་ཕྱེད་སུ་ཞིག་སྟེར།
en: Will give me half his own body.’

source: །དེ་ལྟར་རྒྱལ་པོའི་ལམ་ནས་སྙིང་རྗེ་བ་དང་། དམན་པ་དང་ཞུམ་པའི་ཚིག་སྨྲ་ཞིང་རིམ་གྱིས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་ཕོ་བྲང་སྒོར་སོང་བ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་རྣམས་ཀྱང་ངོ་མཚར་སྐྱེས་ནས་རྗེས་བཞིན་རྗེས་བཞིན་འབྲངས་སོ།
en: “In this manner, the old brahmin kept wailing pitifully, uttering weak and disheartened words as he made his way along the path toward the gate of King Śrīsena’s royal estate. Hundreds and thousands of astonished beings followed after him.

source: །ཡང་བར་སྐབས་དེར་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་རྣམས་ཀྱིས་ད་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་ཕྱིས་འབྱུང་བའི་རྒུད་པ་ཆེན་པོ་དེ་དང་། ལུས་ཀྱི་ཚོར་བ་དྲག་པོ་དེ་ཤེས་ནས་སྡུག་བསྔལ་དྲག་པོས་གདུངས་ཏེ་ཆོ་ངེས་འདེབས་པ་ལ་ཞུགས་སོ།
en: As they proceeded, crowds of gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, and mahoragas, those who understood the physical damage and bodily pain King Śrīsena was about to endure, were tormented by sadness and began to lament.

source: །ཀྱི་ཧུད་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་བྱམས་པའི་བདག་ཉིད་ཅན་སྙིང་རྗེ་དང་ལྡན་པ་སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ་མི་རྟག་པ་ཉིད་ཀྱི་སྟོབས་ཉེ་བར་གནས་པ་ནི་སྡུག་བསྔལ་ལོ།
en: ‘Alas,’ they cried, ‘it is painful to learn that the loving, compassionate King Śrīsena, who is peaceful and affectionate toward all sentient beings, is about to suffer and will be overpowered by impermanence.’

source: །དེ་ཐོས་པ་དང་སྐྱེ་བོའི་ཚོགས་རྣམས་སྨྲེ་སྔགས་འདོན་པར་གྱུར་ཏོ།
en: “Hearing this, the throngs of people began to lament, too.

source: །ཡང་དེའི་ཚེ་འཛམ་བུའི་གླིང་ཐམས་ཅད་འཁྲུགས་ཤིང་ཀུན་དུ་འཁྲུགས་པར་གྱུར་པ་དང་། དུ་བས་མུན་པར་གྱུར་པ་ལ་སྐར་མདའ་ལྟུང་བ་དང་། ཕྱོགས་སྲེག་པ་དང་། བར་སྣང་ལ་ལྷ་རྣམས་རྔ་རྡུང་བར་ཡང་གྱུར་ཏོ།
en: At this time, the whole of Jambudvīpa descended into turmoil and chaos spread everywhere. Smoke darkened the land, meteors fell blazing in all directions, and the celestial gods beat their drums.

source: །ཡང་དེའི་ཚེ་རི་ལ་གནས་པའི་དྲང་སྲོང་དེས་བཙུན་མོ་རྒྱལ་བའི་འོད་འདི་ལྟར་ཁྱོ་དང་བྲལ་བའི་གདུང་བས་དབུགས་ཤིན་ཏུ་རིང་པོར་འབྱིན་ཅིང་ཟས་མི་ཟ་ལ།
en: “While all this was happening, the brahmin who lived in the mountains, who had been offered Queen Jayaprabhā, noticed her distress at being separated from her husband.

source: འདུ་ཤེས་མེད་པར་མཐོང་ནས་སྙིང་རྗེས་སེམས་འདར་ནས་བསམས་པ།
en: He noticed that she sighed heavily, refused to eat, and gave no thought to him.

source: མ་ལ་ངས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ལ་དབུལ་བར་བྱའོ་སྙམ་ནས་བཙུན་མོ་རྒྱལ་བའི་འོད་དབུགས་ཕྱུང་ངོ་།
en: His heart trembled with compassion for her, and he thought, ‘I should give her back to King Śrīsena.’ Queen Jayaprabhā was greatly relieved when he assured her that he would do this.

source: །འཛམ་བུའི་གླིང་ཐམས་ཅད་འཁྲུགས་ཤིང་ཀུན་དུ་འཁྲུགས་པར་ཡང་མཐོང་ངོ་།
en: “He also saw that the whole of Jambudvīpa had descended into great turmoil, and chaos had spread everywhere.

source: །མཐོང་ནས་ཀྱང་ཡང་བྲམ་ཟེའི་ཁྱེའུ་ལ་སྨྲས་པ། བྲམ་ཟེའི་བུ་འདི་ལྟར་འཛམ་བུའི་གླིང་འདི་ཕྱོགས་ཐམས་ཅད་དུ་བས་མུན་པར་གྱུར་ལ་འཁྲུགས་ཤིང་ཀུན་དུ་འཁྲུགས་པར་གྱུར་པ་དང་། ཉི་མ་དང་ཟླ་བ་གཉིས་ཀྱང་ལྷམ་མེ་མ་ཡིན།
en: Seeing this, he said to his disciple, the brahmin boy, ‘Brahmin boy, Jambudvīpa is dark with smoke in every direction; it has descended into great turmoil, and chaos has spread everywhere. Not even the sun and moon are shining, bright and steady.

source: ལྷང་ངེ་མ་ཡིན། ལྷན་ནེ་མ་ཡིན་པས་ངེས་པར་ན་འཛམ་བུའི་གླིང་འདིར་ཡུན་མི་རིང་བ་ཉིད་དུ་སྐྱེས་བུ་ཆེན་པོ་འགའ་ཞིག་འགག་པར་འགྱུར་རོ། །དེ་ནས་དེའི་ཚེ་དྲང་སྲོང་དེས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Surely, in a short time Jambudvīpa’s great being will cease to exist.’ Then the brahmin recited the following verses:

source: མི་འམ་ཅི་ཡི་ཚོགས་དང་ནགས་ཀྱི་ལྷ་རྣམས་དང་། །ནམ་མཁར་གནས་པའི་ལྷ་རྣམས་ཀྱང་ནི་སྨོད་པར་བྱེད།
en: “ ‘The kinnaras, the forest-dwelling gods, And even the celestial gods complain.

source: །ཟླ་བ་འོད་མེད་ཉི་མས་མུན་པ་སེལ་མི་བྱེད།
en: The moon has no light; the sun cannot dispel the darkness.

source: །དེ་རིང་རོལ་མོ་བརྡུངས་ན་སྒྲ་ནི་གྲག་མ་གྱུར།
en: Not even musical instruments make a sound today.

source: །ཤིང་ཚོགས་མེ་ཏོག་འབྲས་བུར་ལྡན་པ་འདི་དག་ཀྱང་།
en: “ ‘Trees with fruit and flowers are falling,

source: །རླུང་གིས་བསྐྱོད་པ་བཞིན་དུ་ས་ལ་ལྷུང་གྱུར་ལ།
en: As if blown over by the wind.

source: །ཇི་ལྟར་འཇིགས་ཤིང་རྩུབ་པའི་སྒྲ་ཀུན་གྲག་པས་ན།
en: Given that everyone has heard the fearsome and awful sounds,

source: །གྲོང་ཁྱེར་དག་ཏུ་སྡུག་བསྔལ་མི་བཟད་འབྱུང་བར་གསལ།
en: It is clear that the city will experience unbearable sorrow.

source: །གྲོང་ཁྱེར་ཨ་རིཥྛ་ན་གནས་དགའི་སྐྱེ་བོ་འདི་ཀུན་ཤིན་ཏུ་སྡུག་བསྔལ་ཞིང་།
en: “ ‘All the residents in the delightful city Ariṣṭa are suffering.

source: །ཕན་ཚུན་སོ་སོར་མྱ་ངན་ཟུག་རྔུས་ངེས་བཅོམ་སྒྲ་རྣམས་རབ་ཏུ་གྲོལ་བའི་བཞིན།
en: Expressing grief and pain among themselves, They say, “We are definitely defeated.”

source: །ལྷ་མོ་ལྟ་བུའི་བཞིན་ལྡན་བུད་མེད་འདི་དག་ཁང་པའི་མཆོག་ན་སྨྲེ་སྔགས་འདོན།
en: Young women with faces like goddesses wail on rooftops.

source: །འདི་ན་མི་དག་དྲག་པོས་རབ་ཏུ་ངུ་དང་དེར་ནི་དུར་ཁྲོད་འཇིགས་བཞིན་ནོ།
en: “ ‘The people weep profusely as if they were in a terrifying cemetery.

source: །ནམ་མཁར་གནས་པའི་སྤྲིན་འདི་ཆུ་མེད་པར་སྒྲ་སྒྲོགས།
en: These clouds hanging in the sky thunder but do not rain.

source: །ས་ལ་གནས་པའི་ཆུ་རྣམས་ཀྱང་ནི་སྐམས་པར་གྱུར།
en: Even the waterholes resting in the earth are drying up.

source: །རྨ་བྱ་རྣམས་ཀྱང་ནགས་ཀྱིས་བཅོམ་བཞིན་སྒྲ་བསྒྲགས་ཏེ།
en: Peacocks scream as if the forest were crushing them.

source: །མི་རྣམས་ཀྱང་ནི་འཁྲུག་བཅས་ཁྱིམ་དུ་རྣམ་པར་རྒྱུ།
en: “ ‘People rush between their homes in turmoil.

source: །ཆུ་ལ་རླུང་གིས་བསྐྱོད་པའི་གྲུ་བཞིན་ས་རྣམས་གཡོས།
en: Their lands shake as if they were a ship at sea, battered by winds.

source: །ཕྱག་དར་དང་འདྲེས་རླུང་ནི་མཁའ་ལ་རབ་ཏུ་ལྡིང་།
en: Gales blast piles of garbage and dust into the air.

source: །ཨ་རིཥྛ་ན་འཇིགས་སྐྱེད་མཚན་མ་མང་བས་ནི།
en: There are many signs of demise in Ariṣṭa.

source: །བྲམ་ཟེ་ཁྱེའུ་འདི་ལས་ཀྱི་རྗེས་འཐུན་ཡུལ་དུ་དེང་།
en: “ ‘Brahmin boy, today in this land with which you have a karmic connection,

source: །བཀྲ་མི་ཤིས་པའི་མཚན་མ་ནི། །ད་ལྟ་འདི་ན་རྣམ་མང་སྟེ།
en: There are many inauspicious signs.

source: །དེ་བས་བདག་ཅག་ཤིས་པ་ཡི།
en: It is only reasonable that we set off

source: །ཕྱོགས་སུ་འགྲོ་བ་ཤིན་ཏུ་རིགས།
en: Toward a place that is auspicious.’

source: །བྲམ་ཟེའི་ཁྱེའུ་རྣམས་གཞན་ཡང་ཇི་ལྟར་ཤིང་འདི་དག་ཐམས་ཅད་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛ་ག་ལ་བ་དེར་འདུད་པར་གྱུར་ཏེ། དེ་བས་ན་ཀྱེ་མ་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ངེས་པར་དེ་རིང་ཉིད་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛར་ཉེ་བར་འཚེ་བ་དང་གནོད་པའི་འཇིགས་པ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: “ ‘Alas, brahmin boys,’ the sage continued, ‘just as these trees are being blown in the direction of the Ariṣṭa royal estate, so it is certain, brahmin boys, that there will long be tremendous fear of harm and destruction in Ariṣṭa.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྟེང་གི་ཁང་བཟངས་ཀྱི་གཞི་ལ་གནས་པས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོའི་ཆོ་ངེའི་སྒྲ་ཐོས་པ་དང་། རིངས་པ་རིངས་པར་རིན་པོ་ཆེ་ལས་བྱས་པའི་ཁང་བཟངས་ལས་བབས་ནས་སེང་གེའི་ཁྲི་ཆེན་པོ་ལ་འདུག་སྟེ།
en: “At the same time, in Ariṣṭa, the bodhisattva was seated on the top floor of his mansion. Hearing a large crowd of people lamenting below, he came down from his mansion made of precious stones and sat on his large lion throne.

source: ཤིན་ཏུ་རྟབས་བག་གིས་ཤེས་ལྡན་དག་འདི་ཅི་ཡིན་འདི་ཅི་ཡིན་ཞེས་དྲིས་སོ།
en: Urgently he asked, ‘Wise ones, what is it? What is happening?’

source: །བར་སྐབས་དེར་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྷའི་བུ་བཞི་པོ་དེ་རྣམས་ཀྱིས་འཕྲལ་དུ་རྒྱལ་པོའི་ཁབ་ཏུ་ཁྱེར་ཏེ།
en: “The four gods carried Śakra, lord of the gods, into the king’s court on his stretcher, and then placed the stretcher on the floor.

source: མོད་ལ་ཁྲི་སའི་སྟེང་དུ་བཞག་པ་དང་། ཁྲི་ལ་བསྐྱོན་པ་ལུས་ཀྱི་ཕྱེད་བཅད་པ་དེ་ལས་ཁྲག་ཀུན་ནས་འཛག་ཅིང་རབ་ཏུ་འཛག་པ་དང་། ལག་པ་གཡས་པ་བརྐྱང་སྟེ་སྙིང་རྗེ་རྗེ་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་རྒྱལ་བ་དང་ཚེ་སྤེལ་བ་བྱས་ནས་མཆི་མས་ཁེངས་པའི་མིག་དང་། རང་གི་ལུས་ཀྱི་ཕྱེད་ཉེ་བར་སྟོན་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ། འཇིག་རྟེན་ན་ཁྱོད་སྙིང་རྗེ་ཅན།
en: Blood dripped from his bisected body, but he still extended his right hand and in a pitiable voice called out salutations of victory and long life to the bodhisattva. As his eyes filled with tears, he displayed his bisected body to the bodhisattva, and implored him, ‘You are this world’s compassionate one.

source: །གཞན་གྱི་སྡུག་བསྔལ་གྱིས་སྡུག་བསྔལ།
en: You suffer the pains of others. Lord, protect me.

source: །ཉིད་ཀྱི་སྐུ་ཡི་ཕྱེད་སྩལ་བས། །གཙོ་བོ་བདག་ནི་བསྐྱབ་ཏུ་གསོལ།
en: Give me half your body.’

source: །དེ་སྐད་ཅེས་ཐོས་པ་དང་། བློན་པོ་ཆེན་པོའི་མཆོག་བློ་གྲོས་ཆེན་པོས་སྨྲས་པ།
en: “Hearing this request, Mahāmati, supreme among ministers, said, ‘Lord, this person is not human.

source: ལྷ་འདི་མི་མ་ལགས་ཀྱི་ཤ་ཟའམ་ཤ་ཟས་བྱིན་གྱིས་བརླབས་པར་གྱུར་པ་ཞིག་སྟེ།
en: He must be a demon or someone possessed by demons.

source: མི་ནི་རྐེད་པར་བཅད་པ་འཚོ་ཞིང་སྔོན་ཇི་ལྟར་གནས་པ་བཞིན་ཚིག་ཏུ་སྨྲ་བ་ནི་མི་སྲིད་དོ།
en: A human would not survive being sliced in half at the waist. It is impossible and unheard of.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། ཤི་བི་པ་ཁྱེད་ཅག་རྣམས་མ་འཇིགས་ཤིག །ང་ནི་ཤ་ཟ་མ་ཡིན་གྱི་གཞན་དུ་ན་ང་ནི་བྲམ་ཟེ་ཡིན་མོད་ཀྱི།
en: “To this, Śakra, lord of the gods, responded, ‘People of Śibi, you need not be afraid. I am not a demon.

source: དབུལ་བས་བདག་གིས་བུ་དང་ཆུང་མ་བཞག་སྟེ།
en: On the contrary, I am a brahmin.

source: ནོར་གྱི་བསམ་པས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་ཐད་དུ་ཆས་ནས་རིམ་གྱིས་སོང་བ་ན་རྒྱལ་པོའི་ཕོ་བྲང་འདིར་ཉི་མ་ནུབ་པ་ན་ཕྱིན་པ་དང་གྲོང་ཁྱེར་གྱི་སྒོ་རྣམས་བཅད་པར་གྱུར་ཏོ།
en: I left my wife and children because we were poor and, intent on creating wealth, I traveled in King Śrīsena’s direction.

source: །དེ་ནས་གྲོང་ཁྱེར་དང་ཧ་ཅང་མི་རིང་བ་ན་བསོད་ནམས་ཁང་ཡོད་པར་བདག་སོང་སྟེ། ནུབ་མོ་གནས་པ་ན་ལམ་གྱིས་དུབ་པས་གཉིད་མཐུག་པོས་ནོན་པ་དང་། སྔོན་གྱི་ལས་ཀྱི་ཉེས་པས་ནུབ་མོ་གཅན་གཟན་སྟག་འོངས་ནས་བདག་གི་ལུས་ཀྱི་ཕྱེད་སོག་ལེ་ལྟ་བུའི་མཆེ་བ་ཤིན་ཏུ་རྣོན་པོས་བཅད་ནས་ཁྱེར་ཏེ་སོང་ངོ་།
en: I came to the royal estate slowly, and by the time I arrived the sun had set, and the city’s gates were closed. I stayed at a manor not far from the city.

source: །དེར་བདག་ཚོར་བ་དྲག་པོས་ཀུན་དུ་བཅོམ་པས་གཉིད་སད་པ་དང་། ཇི་ཙམ་ན་བདག་གི་ལུས་ཀྱི་རོ་སྨད་ཕྱེད་པོ་སྟག་གིས་སོག་ལེས་དྲས་པ་ལྟར་བཅད་པས་བདག་ཚོར་བ་དྲག་པོས་ཀུན་དུ་བཅོམ་ཡང་སྔོན་བྱས་པའི་མི་དགེ་བའི་ལས་རྣམས་ཀྱིས་ཀུན་དུ་བཟུང་བས་ཤི་བར་ནི་མ་གྱུར་གྱི།
en: While I was there, I was overcome by the weariness of traveling and fell into a deep sleep. Because of my previous negative deeds, during the night a tiger came along and used its sharp, saw-like teeth to cut my body in half and steal away the lower half.

source: གཅིག་ཏུ་སྡུག་བསྔལ་བ་དང་། གཅིག་ཏུ་དྲག་པ་དང་། གཅིག་ཏུ་རྩུབ་པ་དང་། གཅིག་ཏུ་ཚ་བ་དང་། གཅིག་ཏུ་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་རྣམས་མྱོང་ཞིང་ཉམ་ཐག་པའི་ང་རོས་སྨྲེ་བར་གྱུར་ཏེ།
en: When I awoke, I experienced an extreme sensation. The tiger may have used its saw-like teeth to cut my body in half, but because I recognized this was caused by my previous actions, I did not die. Still, my suffering was incomparable. It was incomparably violent. It was incomparably harsh. It was incomparably intense. It was an incomparably overwhelming pain, and how I screamed in my misery!

source: བདག་དེ་ལྟར་ཉམ་ཐག་པའི་སྨྲེ་སྔགས་ཐོས་པ་དང་ནམ་མཁའི་དཀྱིལ་ན་གནས་པའི་ལྷ་གཞན་དག་གིས་བདག་དབུགས་དབྱུང་བའི་ཕྱིར་སྨྲས་པ།
en: “ ‘When the celestial gods overheard my cries, they consoled me. A goddess said:

source: མ་འཇིགས་མ་འཇིགས་བྲམ་ཟེའི་མཆོག །ཁྱོད་ནི་ཚེ་ནི་རིང་བར་མཐོང་།
en: “ ‘ “Be not afraid, best of brahmins, be not afraid. We foresee a long life for you.

source: །ཨ་རིཥྛར་ནི་མྱུར་སོང་ན།
en: Once you have swiftly traveled to Ariṣṭa,

source: །ཁྱོད་ནི་ལེགས་པ་དག་ཏུ་འགྱུར།
en: You will be fine.

source: །དེ་ན་ཀུན་སྟེར་རྒྱལ་པོ་ནི།
en: “ ‘ “A king lives there who grants everything.

source: །དེ་ཡི་ལུས་ཀྱི་ཕྱེད་བསླངས་ན།
en: If you beg him for half his body,

source: །དེ་ནི་ངེས་པར་ཁྱེར་ལ་སྟེར།
en: He will certainly give it to you.”

source: །ཞེས་སྨྲས་ནས་ལྷ་མོ་དེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: “ ‘Having said this, the goddess disappeared.

source: །དེ་ནས་བདག་གིས་ལྷ་མོའི་ཚིག་ཐོས་པ་དང་། འཚོ་བར་རེ་བ་ཀུན་དུ་སྐྱེས་ཏེ། འཚེ་བ་ཡང་ཆུང་བར་གྱུར་ཏོ།
en: As I heard these words from the goddess, my hope of survival grew, and the pain subsided.

source: །དེ་ན་བདག་གི་ལུས་ཀྱི་ཕྱེད་རོ་སྨད་མེད་པས་ལངས་ཡང་མ་ནུས་ན་འགྲོ་བར་ལྟ་ག་ལ་ནུས་སྙམ་ནས་ཡང་ཡི་མུག་པར་གྱུར་པ་དང་། སྟེས་དབང་གིས་ཉི་མ་ཤར་བའི་ཚེ་གཉེན་འདི་བཞི་འོངས་པར་གྱུར་ཏོ།
en: Then I became dejected again as I realized I could not get up, let alone walk, with only half of my body. Coincidentally, at dawn, my four kin arrived.

source: །འདི་དག་གིས་ཀྱང་བདག་ཉམ་ང་བར་ཞུགས་པ་མཐོང་བ་དང་། འདི་འཆི་བ་ཉིད་དོ་སྙམ་ནས་ངུ་བར་གྱུར་ཏོ།
en: They started to cry when they saw my desperate state and thought I would die.

source: །དེ་ནས་བདག་གིས་དེ་རྣམས་ལ་དབུགས་དབྱུང་བའི་ཕྱིར་ལྷ་མོའི་ཚིག་རྒྱས་པར་སྨྲས་སོ།
en: To console them, I told them in detail about the goddess’s words.

source: །དེ་ནས་བདག་འདི་རྣམས་ཀྱིས་ཁྲི་ལ་བསྐྱོན་ཏེ་འདིར་ཁྱེར་ཏེ་འོངས་སོ།
en: They placed me on this stretcher and carried me here.’

source: །དེ་སྐད་ཅེས་སྨྲས་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གདོང་མཆི་མའི་རླབས་ཀྱིས་གང་བ་ལྟ་བུར་བདག་ཉིད་ཉེ་བར་སྟོན་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “Having spoken these words, the face of Śakra, lord of the gods, was awash with waves of tears. He then said to the bodhisattva:

source: རྒྱལ་པོ་ཆེན་པོ། བདག་ནི་དབུལ་ཞིང་ན་བ་དང་། །རྒན་པ་དང་ནི་བྲམ་ཟེ་ཉིད།
en: “ ‘Great King, I am poor and sick. I am also an old man and a brahmin.

source: །རང་གི་སྐུ་ཕྱེད་སྩལ་བ་ཡིས།
en: Please give me half your body,

source: །རྙེད་དཀའི་སྲོག་ནི་སྩལ་དུ་གསོལ། །བདག་གི་སྲོག་ནི་སྒྲུབ་བྱེད་པའི།
en: To grant me this life so difficult to find.

source: །སྦྱིན་པ་ཐུགས་རྗེས་སྩལ་དུ་གསོལ།
en: “ ‘Please compassionately grant me

source: །དོན་གྱི་མཆོག་ཕྱིར་སྦྱིན་པ་ནི།
en: The gift of preserving my life.

source: །སྐུ་ཕྱེད་སྦྱིན་པར་སྩལ་དུ་གསོལ།
en: Please give me half your body, Such a gift being the highest of aims.

source: །ཉིད་ཀྱི་སྐུ་ཡི་ཕྱེད་སྩལ་བས།
en: “ ‘By giving me half of your body

source: །བསོད་ནམས་རྒྱ་མཚོ་ལྟར་རྒྱ་ཆེ།
en: The merit accrued will be as vast as the ocean.

source: །དེ་བཞིན་མཁའ་ལྟར་མཐའ་མེད་པའི། །བསོད་ནམས་ཁྱོད་ཀྱིས་ཐོབ་པར་འགྱུར།
en: Similarly, the merit you will gain Will be as limitless as space.

source: །བདག་གི་ཚོར་བ་དྲག་པོ་དང་། །བཀྲེས་སྐོམ་མི་བཟད་ལ་གཟིགས་ནས།
en: “ ‘Having seen my excruciating pain And my unbearable hunger and thirst,

source: །མཆོག་ཏུ་ཐུགས་རྗེ་མཛད་ནས་ནི།
en: Exercise supreme compassion

source: །སྐུ་ཡི་ཕྱེད་ནི་བདག་ལ་སྩོལ།
en: And give me half your body!

source: །བྱང་ཆུབ་སེམས་དཔའ་དགེ་ཁྱོད་ཆོས་ལ་གནས།
en: “ ‘Virtuous bodhisattva, you abide by the Dharma.

source: །གལ་ཏེ་ཐམས་ཅད་མཁྱེན་ཉིད་མཉམ་བཞེད་ན།
en: If you claim to become the equal of an omniscient one,

source: །བདག་ལ་སྐུ་ཕྱེད་འདིར་སྩོལ་དེ་རིང་ནི།
en: Then please give me half your body today.

source: །ཤིན་ཏུ་རྙེད་དཀའི་སྲོག་ནི་ཐོབ་པར་མཛོད།
en: Let me keep this life so difficult to find.

source: །རྒྱལ་པོ་ཆེན་པོའི་སྐུ་ཡི་ཕྱེད།
en: “ ‘Great King, give to me half of your body,

source: །ཤིན་ཏུ་གཏང་དཀའ་བདག་སྩོལ་ལ།
en: Which is so difficult to give;

source: །ཆོས་དང་དེ་བཞིན་གྲགས་པ་ཡིས།
en: If you do, the Dharma, and likewise your fame,

source: །འགྲོ་བ་ཀུན་ལ་ཁྱབ་པར་མཛོད།
en: Will spread throughout the entire world.’

source: །དེ་ནས་ཚིག་འདི་ཐོས་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གོམས་པའི་དགེ་བའི་རྩ་བའི་བག་ཆགས་བློ་ལ་བསྒོས་པས་སྙིང་རྗེས་སེམས་འདར་ཞིང་སློང་བ་དེ་དབུགས་དབྱུང་བའི་ཕྱིར་སྨྲས་པ།
en: “Upon hearing these words, the bodhisattva’s past habits of virtue and his stores of positive predispositions infused his mind, causing him to shake with compassion.

source: བྲམ་ཟེ་ཆེན་པོ་མ་འཇིགས་ཤིག །ད་རིང་པོ་མི་ཐོགས་པར་ལུས་འདི་རྫོགས་པར་འགྱུར་བ་དང་། ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་གྱིས།
en: ‘Great brahmin,’ he consoled him, ‘do not be afraid. Your body will soon be whole. Your wishes will be fulfilled.

source: གཡོ་མེད་པའི་སེམས་ཀྱིས་ཁྱོད་ལ་ལུས་ཀྱི་ཕྱེད་སྦྱིན་པར་བྱའོ་ཞེས་སྨྲས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་རབ་ཏུ་དགའ་བ་དང་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཀྱེ་མ་རང་གི་ལུས་སློང་བ།
en: With an unwavering mind, I offer you half my body.’ His heart filled with joy, the bodhisattva then spoke the following verses:

source: །ཡུན་མི་རིང་བར་བལྟ་བར་བྱ།
en: “ ‘O, soon you will see me

source: །ང་ཡི་ཡན་ལག་གཏང་བ་ནི།
en: Give away my body.

source: །དཀའ་བར་འགྱུར་བ་མ་ཡིན་ནོ།
en: It will not be very difficult To give away my limbs.

source: །ཇི་ལྟར་ཡབ་ཀྱི་བུ་གཅིག་ང་ཡིན་ཡང་།
en: “ ‘Although I am my father’s only son,

source: །དེ་ལྟ་ན་ཡང་ང་ཡི་ལུས་འདི་ཁྱེར།
en: You can take my body.

source: །ལུས་ནི་བྱིན་པས་བྱང་ཆུབ་རྙེད་གྱུར་ཅིང་།
en: Offering my body will result in great awakening.

source: །འགྲོ་འདི་ཤིན་ཏུ་སྡུག་བསྔལ་ལས་གྲོལ་ཤོག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བརྒྱ་བྱིན་བྲམ་ཟེའི་ཆ་བྱད་འཛིན་པ་རྣམ་པ་འདི་ལྟ་བུའི་ཚིག་སྨྲ་བ་ཐོས་པ་དང་།
en: May it alleviate the intense suffering of all beings.’ “The bodhisattva had heard Śakra’s words, which he had spoken in the form of a brahmin.

source: ཡིད་རབ་ཏུ་མགུ་ཞིང་དགའ་བས་མིག་གདངས་བཞིན་དུ་བྲམ་ཟེ་དེ་ལ་སྨྲས་པ། བྲམ་ཟེ་ལུས་འདིའི་ཕྱེད་ལེགས་པར་བྱིན་གྱིས་བར་ཆད་མེད་པར་ལེགས་པར་ལོང་ཤིག་ཅེས་སྨྲས་ནས་འཁོར་དེ་དག་ཐམས་ཅད་ལ་བལྟས་ཏེ་སྐྱེས་བུ་གཞན་ཞིག་ལ་སྨྲས་པ།
en: Therefore, with an entirely satisfied mind and his eyes open, he said, ‘Brahmin, I will give you half my body. Take it without any qualms.’ “Looking around, he saw his attendants and said to one of them, ‘O, you, go quickly and bring me an exceedingly sharp saw.’

source: ཀྱེ་སྐྱེས་བུ་ཁྱོད་རིངས་པར་སོང་ལ་སོག་ལེ་ཤིན་ཏུ་རྣོ་བ་ཁྱེར་ལ་ཤོག་ཤིག །དེ་ནས་སྐྱེས་བུ་དེ་བརྒྱ་བྱིན་གྱིས་ཀུན་ཏུ་རྨོངས་པར་བྱས་པས་ཤིན་ཏུ་རིངས་པ་རིངས་པར་སོག་ལེ་ཉེ་བར་ཁྱེར་ཏེ་འོངས་ནས་སྨྲས་པ།
en: “As he had been enchanted by Śakra, the attendant quickly found a saw and brought it to the bodhisattva.

source: ལྷ་སོག་ལེ་འཚལ་ཏེ་མཆིས་སོ།
en: ‘Lord,’ he said, ‘here is a saw.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རིངས་པ་རིངས་པར་བློན་པོ་ལ་སྨྲས་པ། ཁྱེད་ཅག་རྣམས་ཀྱིས་ཇི་སྲིད་དུ་བྲམ་ཟེ་འདི་འཆི་བདག་གིས་འཇིག་རྟེན་ཕ་རོལ་དུ་མ་ཁྱེར་བ་དེ་སྲིད་དུ་ངའི་རོ་སྨད་སོག་ལེས་མྱུར་དུ་ཆོད་ཅིག་དང་། ངས་བྲམ་ཟེ་འདི་ལ་སྦྱིན་པ་བྱའོ།
en: “Promptly, the bodhisattva said to his ministers, ‘Quickly cut off my lower body and give it to the brahmin, before the Lord of Death takes him to the other world. I offer it to the brahmin.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་མི་བཟད་པའི་ཚིག་སྨྲས་པ་ཐོས་པས་རྡོ་རྗེ་ལྷུང་བས་ཀུན་དུ་སྐྲག་པ་བཞིན་དུ་གྲོང་ཁྱེར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ཤིན་ཏུ་ཡི་མུག་པར་གྱུར་ཏེ། སྡུག་བསྔལ་ལོ། །སྡུག་བསྔལ་ལོ་ཞེས་གསང་མཐོན་པོས་ངུ་བར་གྱུར་ཏོ།
en: “The sound of the bodhisattva’s utterly horrifying words created panic in the city as if they were lightning strikes. ‘Oh, the sorrow, the sorrow!’ the people cried in secret and from on high.

source: །དེ་ནས་བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་ཟུག་རྔུས་གནད་དུ་བསྣུན་པ་བཞིན་དུ་སྡུག་བསྔལ་དྲག་པོས་ཉམ་ཐག་སྟེ།
en: Then Mahāmati, the great minister, was wretched with intense pain, as if a vital organ had been pierced, and his face was as wet from crying as from the rain.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱི་སྐུ་ལ་ཆགས་པ་མེད་པར་ཡོངས་སུ་གཏོང་ངོ་སྙམ་བསམས་ནས་གདོང་ལ་མཆི་མ་ཆར་ལྟར་བབ་པ་དང་། རྐང་པ་གཉིས་ལ་བཏུད་དེ་བྱང་ཆུབ་སེམས་དཔའ་བཟློག་པའི་ཕྱིར་སྨྲས་པ། ལྷ་འདི་མི་སྲིད་དེ།
en: He feared the bodhisattva would give away his body without any attachment to it, and seeking to change his mind, he bowed down at his feet and said, ‘Lord, this is not possible.

source: འདི་ལྟ་སྟེ་ལུས་སོག་ལེས་བཅད་ནས་བཅད་པའི་ལུས་ནི་ངེས་པར་འཆི་བར་འགྱུར་ཏེ།
en: If your body is cut by a saw, you will certainly die.

source: འཆི་ན་ལས་སུ་མི་རུང་བའི་རོར་གྱུར་ལ།
en: If you die, you will become a useless corpse.

source: ལས་སུ་མི་རུང་བས་ནི་བྲམ་ཟེ་ལ་ཡང་བྱས་པ་དོན་མ་མཆིས་པར་འགྱུར་རོ།
en: A useless corpse is no good to this brahmin. Giving your life to him is pointless.

source: །གང་གཞན་གྱི་ཡན་ལག་བཅད་པ་གཞན་གྱི་ཡན་ལག་ལ་འབྱོར་བར་འགྱུར་བ་འདི་ཡང་གནས་མ་མཆིས་སོ།
en: Cutting one person’s limb off and attaching it to another does not work.

source: །དེ་ལྟ་ན་ནི་ལྷའི་ངལ་བ་ཡང་དོན་མ་མཆིས་པར་འགྱུར་རོ།
en: Your divine efforts will be in vain.

source: །དེ་བས་ན་བཟོད་པར་མཛོད་ལ་བདག་ཉིད་དོན་མ་མཆིས་པར་གསོད་པར་མི་མཛད་ཅིང་ཉིད་ཀྱི་སྲོག་ཡོངས་སུ་མི་གཏོང་བར་གསོལ།
en: Please, be patient. Do not kill yourself in vain. Do not give up your life.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་དབུགས་དབྱུང་བའི་ཕྱིར་སྨྲས་པ།
en: “Consoling the great minister Mahāmati, the bodhisattva replied, ‘Mahāmati, leave it be, leave it be.

source: བློ་གྲོས་ཆེན་པོ་ཞོག་ཞོག །ངས་ནམ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ནས་འཁོར་བར་རྒྱུ་བའི་སེམས་ཅན་བསྒྲལ་བར་བྱའོ་ཞེས་ཡིད་ལ་རེ་བ་འདི་ལ་ངའི་བྱང་ཆུབ་ཀྱི་བར་ཆད་མ་བྱེད་ཅིག །བུ་དག་གཞན་ཡང་ཤིན་ཏུ་ཡུན་རིང་པོར་སྡུག་པ་དང་ཡང་དག་པར་འདུས་པར་གྱུར་པ་ཡང་ངེས་པར་འབྲལ་བའི་མཐའ་ཅན་དུ་འགྱུར་བ་འདི་ནི་འཇིག་རྟེན་གྱི་རང་བཞིན་ཡིན་ནོ་ཞེས་སྨྲས་ནས་བྱང་ཆུབ་སེམས་དཔས་སོག་ལེ་ལ་བལྟས་ཏེ། སོག་ལེ་འདིས་ངའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཀྱི་ཕྱོགས་གཅིག་ཏུ་འགྱུར་རོ་ཞེས་རྗེས་སུ་སེམས་ཤིང་ཡང་བློན་པོ་ལ་སྨྲས་པ། ཇི་སྲིད་དུ་བྲམ་ཟེ་འདི་སྲོག་དང་བྲལ་བར་མ་གྱུར་གྱི་བར་དུ་ཁྱོད་ཀྱིས་ངའི་ལུས་ཀྱི་ཕྱེད་རོ་སྨད་མྱུར་དུ་ཆོད་ཅིག །བྲམ་ཟེ་འདི་ཤི་ན་ངའི་བསམ་པ་འབྲས་བུ་མེད་པར་འགྱུར་རོ།
en: At some point, I hope to attain unsurpassed, perfect awakening and liberate saṃsāra’s beings. Do not hinder my awakening. It is the nature of our existence that we must all separate, even from those who have been very dear to us for a long time, like our children.’ Having said this, he glanced once again at the saw and said, ‘This saw is an incomparable object that will direct my merit toward unsurpassed and perfect awakening.’ This is how he thought of it, and again he said to his minister, ‘Cut off the lower half of my body as soon as you can, before the brahmin dies. Otherwise, my intent will be fruitless.’

source: །དེ་ལྟར་བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་དེ་ལྟ་བུའི་རང་གི་ལུས་ཡོངས་སུ་གཏོང་བའི་བསམ་པ་ཤེས་ནས་དེ་མཆི་མ་ཆར་བཞིན་དུ་བབ་པའི་གདོང་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ནས་བཟུང་སྟེ།
en: “Mahāmati, the great minister, knew then that the bodhisattva was determined to give away his body. He held the bodhisattva’s feet in both his hands and kissed them.

source: གདོང་གི་མཆུས་འོ་བྱས་ནས་སྙིང་རྗེ་རྗེ་སྐད་དུ་སྨྲེ་སྔགས་འདོན་པར་གྱུར་ཏེ། ཀྱི་ཧུད་ཇི་ལྟར་ན་འཛམ་བུའི་གླིང་ཡོངས་སུ་སྐྱོང་བ་མཛད་པ། སྙིང་རྗེ་ཆེ་བ། ཡོན་ཏན་དུ་མ་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པའི་ལྷ་ལ་དེ་རིང་ཉིད་དུ་མི་རྟག་པ་ཉིད་ཀྱི་སྟོབས་ཉེ་བར་གནས་པར་གྱུར།
en: As tears flowed down his face like rain, he despaired and, overwhelmed with compassion, said to the bodhisattva, ‘Alas, the force of impermanence will strike the lord today. The lord takes care of all of Jambudvīpa, he is the compassionate one, he has innumerable qualities, and he pleases and is affectionate to all sentient beings.

source: ཀྱེ་མའོ་མི་རྟག་པ་ཉིད་ཀྱི་སྟོབས་དང་ལྡན་པའོ།
en: But, alas, impermanence is powerful!

source: །གང་འཇིག་རྟེན་དུ་ལྷ་ཡང་མཐོང་བའི་སྐྱེས་བུ་དེ་རྣམས་ནི་སྐལ་བ་ཅན་ཡིན་ནོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའི་གདོང་ལ་ཤིན་ཏུ་ཡུན་རིང་དུ་མིག་མི་འཛུམས་པར་བལྟས་ནས་ལྷའི་མི་རྟག་པ་ཉིད་ལ་བལྟ་མི་ནུས་སོ་ཞེས་བསམས་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་མིག་བཙུམས་ནས་བརྒྱལ་ནས་སའི་སྟེང་དུ་འགྱེལ་བར་གྱུར་ཏོ།
en: Whoever has seen the lord was fortunate.’ “Having spoken, he stared at the bodhisattva’s face for a long time without blinking. Then, as he contemplated how he could not bear to witness the bodhisattva’s death, his eyes closed and he fell to the ground unconscious.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སྐྱེས་བུ་ཤིང་མཁན་གཞན་གཉིས་ཤིག་ལ་སྨྲས་པ།
en: The bodhisattva then spoke to two carpenters who happened to be present:

source: བཞིན་བཟངས་དག་འདིར་ངའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་གྲོགས་བྱ་བའི་ཕྱིར་ཁྱེད་ཅག་གཉིས་ཀྱིས་སོག་ལེ་ཐོགས་ཏེ།
en: ‘Good people, will you help me complete the perfection of generosity?
